Revit 2027 API
MEPSystem Properties
The MEPSystem type exposes the following members.
Properties
Name | Description
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BaseEquipment | The base panel or equipment of the system.
BaseEquipmentConnector | The connector within base equipment which is used to connect with system.
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
ConnectorManager | Connector manager of the system.
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
Elements | Terminal elements in the system.
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
HasDesignParts |  Indicates if the system has one or more design parts.
HasFabricationParts |  Indicates if the system has one or more fabrication parts.
HasPlaceholders |  Indicates if the system has one or more placeholders.
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsEmpty |  Indicates if the system is empty or not.
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsMultipleNetwork |  Indicates if the system is well connected or not. The flag will enable the "Divide System" button.
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValid |  Indicates if the system is valid or not. atom AtomValidateSystem default false
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | A human readable name for the Element.
(Inherited from Element)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
PressureLossOfCriticalPath |  The total pressure loss of the sections in critical path.
SectionsCount |  The number of sections.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace